"""
Задание 7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Нужно написать рекурсивную ф-цию только для левой части выражения!
Результат нужно сверить с правой частью.
Правой части выражения в рекурсивной ф-ции быть не должно!
Решите через рекурсию. В задании нельзя применять циклы.
"""


def func(number: int, idx: int, result: int) -> int:
    # Базовый случай
    if idx == number:
        return result + number
    # Шаг рекурсии
    else:
        return func(number, idx + 1, result + idx)


if __name__ == '__main__':
    n = 5
    print(func(n, 1, 0) == n * (n + 1) / 2)
